Revit 2027 API
OptionalFunctionalityUtils.IsDWGExportAvailable Method
 Checks whether the DWG Export functionality is available in the installed Revit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsDWGExportAvailable()
Public Shared Function IsDWGExportAvailable As Boolean
public:
static bool IsDWGExportAvailable()
static member IsDWGExportAvailable : unit -> bool
Return Value
Boolean
 True if the DWG Export functionality is available in the installed Revit.
Remarks
 DWG Export requires presence of certain modules that are optional and may not be part of the installed Revit.
See Also
Reference
OptionalFunctionalityUtils Class
Autodesk.Revit.DB Namespace